Revit 2027 API
IndexPoint.Index Property
 The index of the point's vertex.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
public:
property int Index {
	int get ();
	void set (int value);
}
member Index : int with get, set
Property Value
Int32
See Also
Reference
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace